<html>

<head>
<meta http-equiv="Content-Language" content="en-us">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>&#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; AddIn &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</title>
</head>

<body>

<h2><span lang="ru">&#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; </span>AddIn
<span lang="ru">&#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</span></h2>
<p><span lang="ru">&#1055;&#1088;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; 
&#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; </span>AddIn<span lang="ru">, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1072;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; 
&#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1044;&#1083;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1086;&#1075;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1080;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; </span>
AddIn<span lang="ru">, &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; </span>LogAddIn<span lang="ru">, &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1055;&#1088;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086; &#1089;&#1082;&#1072;&#1085;&#1077;&#1088;&#1086;&#1084; 
&#1096;&#1090;&#1088;&#1080;&#1093;&#1082;&#1086;&#1076;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; </span>
ScanSymb<span lang="ru">.</span></p>
<p><span lang="ru">&#1055;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;
</span>AddIn<span lang="ru"> &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1074;&#1072; 
&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072; - &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; </span>AddIn<span lang="ru"> &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1076;&#1072;&#1084;&#1080; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;
</span>AddIn<span lang="ru"> &#1080; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1089; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1080;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1080; 
&#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089; &#1087;&#1088;&#1080;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080;, &#1101;&#1090;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; 
&#1073;&#1099;&#1090;&#1100;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1080; </span>ScanSymb <span lang="ru">&#1080; </span>LogAddIn<span lang="ru">.</span></p>
<p class="MsoNormal">&#1042; <span lang="ru">&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;&#1093;</span> ScanSymb <span lang="ru">
&#1080; </span>LogAddIn<span lang="ru"> &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;</span> &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;<span lang="ru">:</span>
</p>
<ul>
	<li>
	<p class="MsoNormal">&#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;<span lang="ru">, 
	&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1074;</span> <span lang="ru">&#1054;&#1057; </span><span lang="EN-US">Windows 
	Mobile</span> (<span lang="EN-US">logaddin</span>.<span lang="EN-US">vcp
	</span>&#1080; <span lang="EN-US">scansymb</span>.<span lang="EN-US">vcp </span>
	&#1076;&#1083;&#1103; <span lang="EN-US">Embedded Visual C</span>++ 3.0)</li>
	<li>
	<p class="MsoNormal">&#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;<span lang="ru">, 
	&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1074;</span> <span lang="ru">&#1054;&#1057; </span><span lang="EN-US">Windows 
	CE</span>&nbsp; (<span lang="EN-US">logaddinCE</span>.<span lang="EN-US">vcp
	</span>&#1080; <span lang="EN-US">scansymbCE</span>.<span lang="EN-US">vcp</span> 
	&#1076;&#1083;&#1103; <span lang="EN-US">Embedded Visual C</span>++ 4.0)</li>
	<li>
	<p class="MsoNormal"><span lang="ru">&#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, 
	&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1085;&#1072; &#1055;&#1050; </span>(<span lang="EN-US">logaddin</span>.<span lang="EN-US">vcproj
	</span>&#1076;&#1083;&#1103; <span lang="EN-US">Visual C</span>++ 2003). </li>
</ul>
<p class="MsoNormal">&#1055;&#1088;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1089;<span lang="ru">&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081;</span> 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; <span lang="ru">&#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; </span>&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;<span lang="ru">&#1086;&#1074; 
(&#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;)</span> <span lang="ru">&#1080;</span> &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1084; &#1082;&#1072;&#1082; 
&#1086;&#1073;&#1088;&#1072;&#1079;&#1094;&#1086;&#1084;.</p>
<span style="line-height: 115%; font-family: Times New Roman">
&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; 
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1074; &#1083;&#1086;&#1075;<span lang="ru">-&#1092;&#1072;&#1081;&#1083;</span>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; 
&#1092;&#1072;&#1081;&#1083;&#1077; </span>
<span lang="EN-US" style="line-height: 115%; font-family: Times New Roman">
addin</span><span style="line-height: 115%; font-family: Times New Roman">/</span><span lang="EN-US" style="line-height: 115%; font-family: Times New Roman">log</span><span style="line-height: 115%; font-family: Times New Roman">.</span><span lang="EN-US" style="line-height: 115%; font-family: Times New Roman">h
</span><span style="line-height: 115%; font-family: Times New Roman">
&#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1086;&#1084; </span>
<span lang="EN-US" style="line-height: 115%; font-family: Times New Roman">
USE</span><span style="line-height: 115%; font-family: Times New Roman">_</span><span lang="EN-US" style="line-height: 115%; font-family: Times New Roman">LOG</span><span style="line-height: 115%; font-family: Times New Roman">.</span><font face="Times New Roman">
</font>

</body>

</html>
